<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"d2518c234d3ca14d68350868efdb96cbce807b45f7d9a2db0a626ad94399fc8a","plan_job_ref":"Job Terraform plan #76 at https://github.com/GSA-TTS/FAC/actions/runs/4570080075","plan_hash":"814415b508e9bc63b0cfa6a309bbbe26638df03c1f4c2bc6ecf43b6a5e9347a8","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be created
  + resource "cloudfoundry_app" "clamav_api" {
      + buildpack                  = (known after apply)
      + disk_quota                 = 2048
      + docker_image               = "ajilaag/clamav-rest:20230228"
      + enable_ssh                 = (known after apply)
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = (known after apply)
      + memory                     = 3072
      + name                       = "fac-av-production"
      + ports                      = (known after apply)
      + space                      = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "none"
      + timeout                    = 600

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.module.clamav.cloudfoundry_network_policy.clamav_routing will be created
  + resource "cloudfoundry_network_policy" "clamav_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.clamav.cloudfoundry_route.clamav_route will be created
  + resource "cloudfoundry_route" "clamav_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "fac-av-production"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.database.cloudfoundry_service_instance.rds will be created
  + resource "cloudfoundry_service_instance" "rds" {
      + id                             = (known after apply)
      + name                           = "fac-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "c1ddc2d6-983b-4ced-9995-064d9dde07aa"
      + space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.s3-private.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "fac-private-s3"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
      + space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.s3-public.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "fac-public-s3"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "a8098705-833a-4cb1-b83d-0e247008c912"
      + space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #76](https://github.com/GSA-TTS/FAC/actions/runs/4570080075)